---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterStringContains
source: html/6bc4fe24-ccee-c12a-cb0b-e5f1d026aaa4.htm
---
# FilterStringContains Methods

Derived classes override this method to implement the test that determines
 whether the two given string values satisfy the desired condition or not.